cfd/cases/baseline/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }

dimensions      [ 0 1 -1 0 0 0 0 ];
internalField   uniform (16.667 0 0);   // 60 km/h

boundaryField
{
    inlet       { type fixedValue;    value uniform (16.667 0 0); }
    outlet      { type zeroGradient; }
    top         { type symmetryPlane; }
    bottom      { type symmetryPlane; }
    rider       { type noSlip; }
    front       { type empty; }
    back        { type empty; }
}
