cfd/cases/baseline/constant/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }

simulationType  RAS;
RAS
{
    RASModel        kOmegaSST;   // best for attached BL + mild separation (Re 1e5-1e6)
    turbulence      on;
    printCoeffs     on;
}
