cfd/cases/baseline/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }

application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1000;       // pseudo-time iterations
deltaT          1;
writeControl    timeStep;
writeInterval   100;
purgeWrite      3;
writeFormat     binary;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    forces
    {
        type            forces;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   10;
        patches         (rider);
        rho             rhoInf;
        rhoInf          1.225;
        CofR            (0 0.95 0);   // approx rider CoM
        log             true;
    }

    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   10;
        patches         (rider);
        rho             rhoInf;
        rhoInf          1.225;
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         16.667;   // 60 km/h
        lRef            1.9;      // rider height
        Aref            0.50;     // frontal area m² (upright estimate)
        CofR            (0 0.95 0);
        log             true;
    }

    residuals
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (U p k omega);
    }
}
