cfd/cases/baseline/system/snappyHexMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object snappyHexMeshDict; }

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    rider_upright.stl
    {
        type triSurfaceMesh;
        name rider;
    }
}

castellatedMeshControls
{
    maxLocalCells  2000000;
    maxGlobalCells 5000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 30;

    features
    (
        { file "rider_upright.eMesh"; level 5; }
    );

    refinementSurfaces
    {
        rider
        {
            level (4 5);   // 16–32 subdivisions → ~6–12 mm at rider surface
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        rider
        {
            mode inside;
            levels ((1E15 6));  // refine everything inside geometry
        }
    }

    locationInMesh (5 0 0.05);   // a point in the fluid domain
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance    2.0;
    nSolveIter   100;
    nRelaxIter   5;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        rider { nSurfaceLayers 5; }
    }
    expansionRatio      1.3;
    finalLayerThickness 0.3;
    minThickness        0.1;
    nGrow               0;
    featureAngle        60;
    nRelaxIter          3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals      3;
    nSmoothThickness    10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle  90;
    nBufferCellsNoExtrude 0;
    nLayerIter          50;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-30;
    minArea             -1;
    minTwist            0.05;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;
}
